from typing import Union

def sravnitel(a: int | float, b: int | float) -> str:
    '''Возвращает отношение двух чисел в соответствии с условием задачи:\n
    \n 1\) a > b
    \n 2\) a < b
    \n 3\) a = b
    \n 4\) a > 3 * b (если 'a' более чем в 3 раза больше 'b' и если оба числа больше нуля)
    '''
    
    return f'a {"> 3 *" if b > 0 and a > 0 and a / b > 3 else ">" if a > b else "<" if a < b else "="} b'

def iteration(a: str, b: str) -> None:
    '''
    Принимает две строки и пытается преобразовать в числа. \n
    Если же при вызове функций float(a) или float(b) возникает исключение ValueError, \n
    то ловим его и вызываем собственное с нужным нам сообщением. Это сообщение используется в unit тесте. \n 
    Если же при преобразование произошло без ошибок, то мы просто выводим результат работы sravnitel. \n
    '''
    
    try:
            
        a = float(a)
        b = float(b)
        
    except ValueError: 
        
        raise ValueError('Похоже, вы ввели какие-то символы, которые не позволяют сделать преобразование в число с плавающей точкой.')
        
    print(sravnitel(a, b))
        

def main():
    '''
    Главная функция программы.\n
    В ней запускается бесконечный цикл, в который мы передаём 1 \n
    (можно передать любое число, отличное от нуля, и тогда цикл будет работать бесконечно). \n
    В цикле мы объявляем две переменные и предлагаем пользователю ввести значения с клавиатуры. \n
    После этого мы вызываем iteration и передаём в него строки, которые пользователь ввёл с клавиатуры.
    '''

    while 1:
        
        a = input("Введите произвольное число: ")
        b = input("Введите пограничное число: ")
        
        iteration(a, b)

if __name__ == '__main__': main()