def main(): 
    """
    В этих работах всегда будет главная функция, в которой будет вызываться всё остальное (привычка после выполнения лаб по C++)
    (В данном случае вызывать нечего, я не стал выделять отдельную функцию для решения задачи)
    """
    
    # Бесконечный цикл. В Python классы Bool и Integer связаны таким образом, что 0 всегда является False, а всё остальное True
    while 1:
     
        a = int(input("Введите произвольное число: ")) # Программа принимает ввод с клавиатуры и преобразует его в тип int
        b = int(input("Введите пограничное число: "))
        
        # Тут у нас f-string. В такой строке в фигурных скобках можно прописывать практически любую логику
        print(f'a {"> 3 *" if a / b > 3 else ">" if a > b else "<"} b')
        # Здесь я использовал сокращённую запись условного блока if (иначе говоря тернарный оператор)

# Этот условный блок содержит в себе так назыаемую магическую переменную.
# __name__ позволяет узнать имя запускаемого файла, в данном случае она нужна,
# чтобы при импорте файла в другой проект у нас не выполнялись вызываемые функции.
# (import устроен таким образом, что вся логика при импортировании выполняется в файле, в котором происходит импорт)
if __name__ == '__main__': main()
