# По формулировке задания не совсем понятно, как именно выполнять задание,
# (каждый пункт отдельно или все пукнты применяются одновременно к одной строке)
# поэтому, чтобы вводимая строка не изменялась, я описал для каждого пункта задания отдельную функцию.

def SkipTheThirdLetter(string: str):
    
    # Цикл for с перебором значений индексов принимаемой строки. len используется для получения длины строки, range возвращает нам диапазон в зависимости
    # от того, какие параметры принимает. В данном случае он даст диапазон от нуля до {длина строки -= 1}.
    for i in range(len(string)): 
        
        # Если {переменная цикла != 2}, то мы обращаемся к переданной строке чтобы вывести символ.
        # Вообще было бы лучше использовать для выполнения этого задания срезы, но по условию нужно использовать циклы.
        if i != 2: print(string[i], end='') 
    
    print() # Пустой вывод, чтобы было расстояние в консоли между ответами на пункты.

def LookingForC(string: str):

    for i in string: # Здесь мы не перебираем индексы, а сразу обращаемся к символам строки
        
        # По условию непонятно, какая буква имеется в виду (английская СИ или русская ЭС), поэтому в условии проверка на обе буквы
        if i == 'c' or i == 'с': 
            
            # В том случае, если условие сработало, мы печатаем сообщение о том, что буква найдена, и выходим из функции с помощью return,
            # чтобы цикл не продолжал перебор
            print('Найдена буква "c".') 
            return

def LenOfString(string: str):

    # Задание не имеет смысла, поскольку для нахождения длины строки используется len()
    # Перебираем символы в цикле и увеличиваем счётчик количества символов
    
    counter = 0

    for i in string:

        counter += 1

    print(f'Длина строки: {counter}')

def SkipTheLastLetter(string: str):

    for i in range(len(string)):

        if i != len(string) - 1: print(string[i], end='')

    print()

def main():
    
    someString = input('Введите произвольную строку: ')

    SkipTheThirdLetter(someString)
    LookingForC(someString)
    LenOfString(someString)
    SkipTheLastLetter(someString)

if __name__ == '__main__': main()
